# PhaseLoadType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PanelScheduleData..::..PhaseLoadType Property
PanelScheduleData Class See Also
---
This property determines the layout of the phase load columns; setting this value must go through the updateCircuitTable function
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PanelSchedulePhaseLoadType PhaseLoadType { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PhaseLoadType As PanelSchedulePhaseLoadType
	Get
```

Visual C++
---
```text
public:
property PanelSchedulePhaseLoadType PhaseLoadType {
	PanelSchedulePhaseLoadType get ();
}
```

# See Also
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace